Revit 2026 API

# RibbonPanel Methods

---

The RibbonPanel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Adds a Ribbon item to the panel. |
|  | AddSeparator | Adds a new Separator to the panel. |
|  | AddSlideOut | Adds a slideout to the current panel. |
|  | AddStackedItems(RibbonItemData, RibbonItemData) | Adds two stacked items to the panel. |
|  | AddStackedItems(RibbonItemData, RibbonItemData, RibbonItemData) | Adds three stacked items to the panel. |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetItems | Gets a copy of the collection of RibbonItems assigned to the RibbonPanel. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace